app/controllers/gigs_controller.rb

SELECT `gigs`.* FROM `gigs` WHERE (date between '2012-06-20' and '2012-07-31') ORDER BY date
---
  def feed
    @gigs = Gig.all