app/controllers/home_controller.rb

SELECT `slides`.* FROM `slides`
SELECT COUNT(*) FROM `gigs` WHERE (date between '2012-06-20' and '2012-07-01')
SELECT `gigs`.* FROM `gigs` WHERE (start_date between '2012-06-20' and '2012-07-01') ORDER BY date LIMIT 8 OFFSET 0
SELECT `scwidgets`.* FROM `scwidgets`
---
  def index
    @slides = Slide.all
    @gigs = Gig.order(:date).upcoming.paginate(:page => params[:page], :per_page => 12)
    @scwidgets = Scwidget.all